def calculate_determinant(matrix):
    """
    Входные данные: исходная матрица matrix

    Что делает функция?
    Функция находит определитель матрица путём перемножения
    диагональных элеметов матрицы U (рез-та LU-декомпозиции)
    Данная реализация предпочтительнее "классического" нахождения
    определителя через миноры, тк алгоритм при использовании
    последних имеет сложность O(n)=n!. Вместо этого используется
    часть результата LU-декомпозиции, сложность которой O(n)=n^3

    Возвращаемое значение: определитель матрицы
    """
    L,U = LU_decomposition(matrix)
    O = 1
    for i in range(len(U[0])):
        O *= U[i][i]
    return O